/* Найдите произведение пар чисел в одномерном массиве.
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
Результат запишите в новом массиве.
[1 2 3 4 5] -> 5 8 3
[6 7 3 6] -> 36 21
*/

int InputNum(string message)
{
    Console.Write(message);
    return int.Parse(Console.ReadLine()!);
}

int[] CreateArray(int size)
{
    return new int[size];
}

void FillArray(int[] array, int min, int max)
{
    Random rnd = new Random();
    for (int i = 0; i < array.Length; i++)
        array[i] = rnd.Next(min, max + 1);
}

string PrintArray(int[] array)
{
    string res = String.Empty;
    for (int i = 0; i < array.Length; i++)
        res += array[i] + " ";
    return res;
}

int[] MultPairs(int[] array)
{
    int[] newArr = new int[array.Length / 2 + array.Length % 2];
    int length = array.Length;
    for (int i = 0; i < length / 2; i++)
    {
        newArr[i] = array[i] * array[(length - 1) - i];
    }
    if (array.Length % 2 == 1)
        newArr[newArr.Length - 1] = array[length / 2];
    return newArr;
}

int size = InputNum("Введите размер массива:  ");
int minValue = InputNum("Введите минимальное значение элемента: ");
int maxValue = InputNum("Введите максимальное значение элемента: ");

int[] myArray = CreateArray(size);
FillArray(myArray, minValue, maxValue);
string txt = PrintArray(myArray);
Console.WriteLine(txt);

int [] newArray = MultPairs(myArray);
txt=PrintArray(newArray);
Console.WriteLine(txt);
